In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({"rollno":[1,2,3,4],"Name":["a","b","c","d"]})

In [5]:
df

   rollno Name
0       1    a
1       2    b
2       3    c
3       4    d

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  4 non-null      int64
 1   Name    4 non-null      object
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [7]:
df.describe()

         rollno
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [8]:
df.isnull()

   rollno   Name
0   False  False
1   False  False
2   False  False
3   False  False

In [9]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [19]:
x

    0
6   1
7   2
8   3
9   4
10  5

In [20]:
x=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]],index=[1,2],columns=['a','b','c','d','e'])

In [21]:
x

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [22]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
 3   d       2 non-null      int64
 4   e       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0 bytes

In [23]:
x.describe()

              a         b         c         d          e
count  2.000000  2.000000  2.000000  2.000000   2.000000
mean   3.500000  4.500000  5.500000  6.500000   7.500000
std    3.535534  3.535534  3.535534  3.535534   3.535534
min    1.000000  2.000000  3.000000  4.000000   5.000000
25%    2.250000  3.250000  4.250000  5.250000   6.250000
50%    3.500000  4.500000  5.500000  6.500000   7.500000
75%    4.750000  5.750000  6.750000  7.750000   8.750000
max    6.000000  7.000000  8.000000  9.000000  10.000000